In [1]:
!pip install pymysql

Requirement already satisfied: pymysql in c:\users\hp\anaconda3\lib\site-packages (1.0.2)

In [2]:
import pymysql
import pandas as pd

con=pymysql.connect(
        host="localhost",
        user="root",
        password="1234",
        database="sql_exercises")
cursor=con.cursor();

In [3]:
s="select * from emp"
cursor.execute(s)

6

In [4]:
a=cursor.fetchall()

In [5]:
a

((100, 'Alejandro', Decimal('14000.00'), datetime.date(1998, 1, 12)),
 (101, 'Davide', Decimal('14501.00'), datetime.date(1997, 9, 14)),
 (102, 'Raul', Decimal('15000.00'), datetime.date(2009, 9, 24)),
 (103, 'Andreas', Decimal('16000.00'), datetime.date(2001, 7, 16)),
 (104, 'Xavi', Decimal('15500.00'), datetime.date(1988, 10, 14)),
 (105, 'Marc', Decimal('15600.00'), datetime.date(2001, 3, 17)))

In [6]:
df=pd.read_sql(s,con)
df

   empid    empname   salary joining_date
0    100  Alejandro  14000.0   1998-01-12
1    101     Davide  14501.0   1997-09-14
2    102       Raul  15000.0   2009-09-24
3    103    Andreas  16000.0   2001-07-16
4    104       Xavi  15500.0   1988-10-14
5    105       Marc  15600.0   2001-03-17

In [22]:
updated_salary = []

for empid, empname, salary, joining_date in a:
    updated_salary.append((salary+(salary/10), empid))

print(updated_salary)
p=pd.DataFrame(updated_salary)
p

[(Decimal('15400.00'), 100), (Decimal('15951.10'), 101), (Decimal('16500.00'), 102), (Decimal('17600.00'), 103), (Decimal('17050.00'), 104), (Decimal('17160.00'), 105)]

          0    1
0  15400.00  100
1  15951.10  101
2  16500.00  102
3  17600.00  103
4  17050.00  104
5  17160.00  105

In [24]:
x="update emp set salary=%s where empid=%s"
cursor.executemany(x,updated_salary)

6

In [30]:
cursor.execute(s)

6

In [34]:
a=pd.read_sql(s,con)
a

   empid    empname   salary joining_date
0    100  Alejandro  15400.0   1998-01-12
1    101     Davide  15951.1   1997-09-14
2    102       Raul  16500.0   2009-09-24
3    103    Andreas  17600.0   2001-07-16
4    104       Xavi  17050.0   1988-10-14
5    105       Marc  17160.0   2001-03-17